Revit 2027 API
DWFExportOptions.ExportObjectData Property
Whether to include properties associated with elements.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool ExportObjectData { get; set; }
Public Property ExportObjectData As Boolean
	Get
	Set
public:
property bool ExportObjectData {
	bool get ();
	void set (bool value);
}
member ExportObjectData : bool with get, set
Property Value
Boolean
Remarks
ExportObjectData must be enabled (true) in order to also enable exporting rooms and areas (ExportingAreas). If ExportObjectData is disabled, the ExportingAreas property will be ignored.
See Also
Reference
DWFExportOptions Class
Autodesk.Revit.DB Namespace